{
  "timestamp": "2023-08-23T02:12:40.0000000+00:00",
  "category": {
    "oldValue": [
      "DoD",
      "GCC",
      "GCC High",
      "General Availability",
      "In development",
      "Microsoft Edge",
      "Web",
      "Worldwide (Standard Multi-Tenant)"
    ],
    "newValue": [
      "DoD",
      "GCC",
      "GCC High",
      "General Availability",
      "Launched",
      "Microsoft Edge",
      "Web",
      "Worldwide (Standard Multi-Tenant)"
    ]
  },
  "title": {
    "oldValue": "Microsoft Edge: Microsoft Edge for Business",
    "newValue": "Microsoft Edge: v.116 - Microsoft Edge for Business"
  },
  "description": {
    "oldValue": ",Microsoft Edge for Business aims to address the\nneeds of both end users and IT Pros. It is designed to help meet the needs of\nthe evolving security landscape while empowering users to be more productive.\nIn addition to the rich set of native enterprise controls, it now supports a\nnew look and feel, automatic switching to keep your work and personal browsing\nseparate, a lightly managed Enterprise Personal Browser window (MSA profile),\nsupport for Unmanaged BYOPC, and Company Branding.  Microsoft Edge for Business\nwill be the standard browser experience for organizations and will get\nactivated by Azure Active Directory (AAD) login.   <br>More info: https://learn.microsoft.com/en-us/deployedge/microsoft-edge-for-business",
    "newValue": ",Microsoft Edge for Business on desktop and mobile aims to address the needs of both end users and IT Pros. It is designed to meet the needs of the evolving security landscape while empowering users to be more productive by enhancing focus. In addition to native enterprise controls that you're already familiar with in Microsoft Edge, Microsoft Edge for Business includes new visual elements, including an adjusted icon, and optional automatic switching between a personal browser window (activated by Microsoft account MSA login) and a work browser window (activated by Entra ID login). All users who sign into Edge using Microsoft Entra ID (formerly Azure Active Directory) will automatically be transitioned to Microsoft Edge for Business as part of the release.   <br>More info: https://learn.microsoft.com/en-us/deployedge/microsoft-edge-for-business"
  }
}
