{
  "guid": "93195",
  "link": "https://www.microsoft.com/microsoft-365/roadmap?featureid=93195",
  "category": [
    "DoD",
    "GCC",
    "GCC High",
    "General Availability",
    "Launched",
    "Microsoft Purview compliance portal",
    "Web",
    "Worldwide (Standard Multi-Tenant)"
  ],
  "title": "Microsoft Purview | Communication Compliance Recommended policy\nactions",
  "description": "Recommended policy actions help organizations discover trends that they\nmay not be aware of, like harassment, threats or sharing of sensitive\ninformation. Insights for sensitive information types are surfaced\nautomatically through the existing compliance portal data classification\nservice while insights for machine learning classifiers require an organization\nto have already configured a policy in Communication Compliance. Insights for\nboth sensitive information types and machine learning classifiers are designed\nto help organizations holistically set up parameters for internal governance by\nidentifying potential areas of risk and determining the type and scope of\ncommunication policies to be configured. Recommended policy actions displays\nthe aggregate number of matches per classification type, with none of the\ninsights containing any personally identifiable information.Microsoft\nPurview Communication Compliance provides the tools to\nhelp organizations detect regulatory\ncompliance violations (e.g. SEC or FINRA), such as sensitive or confidential\ninformation, harassing or threatening language, and sharing of adult content.\nBuilt with privacy by design, usernames are pseudonymized by default,\nrole-based access controls are built in, investigators are opted in\nby an admin, and audit logs are in place to help ensure user-level privacy.<br>More info: https://docs.microsoft.com/en-us/microsoft-365/compliance/communication-compliance?view=o365-worldwide",
  "pubDate": "Mon, 21 Mar 2022 23:04:40 -0700",
  "updated": "2023-03-30T22:59:47-07:00",
  "publicDisclosureAvailabilityDate": "October CY2022",
  "publicPreviewDate": null
}
